Backend/app/controllers/posts_controller.rb

UPDATE "posts" SET "like_count" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["like_count", 1], ["updated_at", "2019-02-04 17:14:10.431562"], ["id", 40]]
---
  def update
    find_post
    @post.update(post_params)